import React from "react";
import { GiMilkCarton } from "react-icons/gi";
import { BiCreditCard } from "react-icons/bi";
import { GiCampingTent } from "react-icons/gi";
import { FaBriefcaseMedical } from "react-icons/fa";
import { BsFillBagHeartFill } from "react-icons/bs";
import { GiNecklaceDisplay } from "react-icons/gi";
import { GiClothes } from "react-icons/gi";
import { CgSmartHomeRefrigerator } from "react-icons/cg";
import { GiSofa } from "react-icons/gi";
import { CiLaptop } from "react-icons/ci";
import { GiPencilRuler } from "react-icons/gi";
import { BsPhone } from "react-icons/bs";
import { SlWrench } from "react-icons/sl";
import { IoCarSportOutline } from "react-icons/io5";
import { LuBaby } from "react-icons/lu";
function ProductModalData() {
  const sidebarMenuData = [
    {
      title: "موبایل",
      logo: <BsPhone size={20} />,
      id: 1,
      detailMenu: [
      
        {
          title: "برند های مختلف گوشی موبایل ",
          items: [
            " گوشی آیفون ",
            "گوشی سامسونگ ",
            " گوشی نوکیا",
            "گوشی آنر ",
            " گوشی موتورلا  ",
            " گوشی نانگ فون ",
            " گوشی جی پلاس   ",
            " گوشی هوآوی   ",
            " گوشی جی ال ایکس   ",
            " گوشی جنرال لوکس     ",
            " گوشی داریا      ",
            " گوشی گوگل      ",
            " گوشی اویو      ",
            " گوشی لرد      ",
            " گوشی موبایل رنسو      ",
          ],
        },
        {
          title: "داغ ترین ها",
          items: [
            " گلکسی S23 ultra   ",
            "   A54 گلکسی ",
            "   A34 گلکسی ",
            "   A24 گلکسی ",
            "   A14 گلکسی ",
            "   S23 FE گلکسی ",
            "    ردمی نوت 12",
            "   C40 پوکو ",
            "   XS Pro 5G پوکو ",
            "   A2 Plus ردمی  ",
            "   M5s پوکو ",
            "   X9a آنر ",
            "    موتورلا moto E13  ",
            "   جی پلاس Q20s ",
            "     داریا باند 5G ",
          ],
        },
        {
          title: "   گوشی بر اساس عملکرد ",
          items: [
            " گوشی  گیمینگ ",
            "گوشی  5G ",
            " گوشی دکمه ای ",
            "گوشی دکمه ای   ",
            " گوشی    ضد آب  ",
            " گوشی  مناسب عکاسی ",
            " گوشی   میان رده     ",
            " گوشی اقتصادی",
            " گوشی دانش آموزی",
            " گوشی پرچمدار ",
            " گوشی دو سیمکارت ",
          ],
        },
        {
          title: "    لوازم جانبی موبایل ",
          items: [
            " شارژر گوشی",
            " قاب و کاور گوشی",
            " گلس گوشی",
            " هولدر گوشی موبایل",
            " کابل شارژ و مبدل ",
            " گوشی  تا 16  مگاپیکسل ",
            " گوشی  تا 48  مگاپیکسل ",
            " گوشی  تا 64  مگاپیکسل ",
            " گوشی  تا 108  مگاپیکسل ",
          ],
        },
        {
          title: "   گوشی بر اساس قیمت ",
          items: [
            " گوشی موبایل ارزان ",
            "گوشی موبایل قسطی ",
            " گوشی تا ۲ میلیون تومان",
            "گوشی تا 5 میلیون تومان ",
            " گوشی تا ۷ میلیون تومان  ",
            " گوشی  تا ۱۵ میلیون تومان ",
            " گوشی  بالای ۱۵ میلیون تومان   ",
          ],
        },
        {
          title: "    هدفون   ",
          items: [
            "  هدفون بی سیم",
            "  هدفون اپل(ایرپاد)",
            " هدفون بیتس ",
            "  هدفون  سونی",
            "  هدفون سامسونگ (ایرپادز)",
            "  هدفون  شیائومی",
            "  هدفون  جی بی ال",
          ],
        },
        {
          title: "   گوشی بر اساس حافظه داخلی ",
          items: [
            " گوشی  تا 16  گیگابایت ",
            " گوشی  تا 32  گیگابایت ",
            " گوشی  تا 64  گیگابایت ",
            " گوشی  تا 128  گیگابایت ",
            " گوشی  تا 256  گیگابایت ",
            " گوشی  تا 1  ترابایت ",
          ],
        },
        {
          title: "    تبلت   ",
          items: [
            "  تبلت سامسونگ",
            "  تبلت اپل (آی پد)",
            "  تبلت شیائومی",
            "  تبلت لنوو",
            "  تبلت مایکروسافت",
            "  تبلت دانش آموزی",
          ],
        },
        {
          title: "   گوشی بر اساس رزولوشن عکس ",
          items: [
            " گوشی  تا 13  مگاپیکسل ",
            " گوشی  تا 16  مگاپیکسل ",
            " گوشی  تا 48  مگاپیکسل ",
            " گوشی  تا 64  مگاپیکسل ",
            " گوشی  تا 108  مگاپیکسل ",
          ],
        },

        {
          title: "برند های برتر  ",
          items: [
            "   اپل   ",
            "   سامسونگ   ",
            "   هوآوی   ",
            "   آنر   ",
            "   ردمی   ",
          ],
        },

        {
          title: "    ساعت و مچ بند هوشمند   ",
          items: [
            "  ساعت هوشمند سامسونگ ",
            "  ساعت هوشمند شیائومی ",
            "    اپل واچ ",
          ],
        },
      ],
    },

    {
      title: "کتاب و لوازم تحریر و هنر",
      logo: <GiPencilRuler size={20} />,
      id: 2,
      detailMenu: [
        {
          title: " لوازم تحریر    ",
          items: [
            " لوازم اداری و اقلام مصرفی ",
            "  کیف، کوله پشتی و جامدادی",
            "  چراغ مطالعه",
            "  کاغذ کادو ، پاکت و کارت هدیه",
            " نوشت افزار   ",
            "   دفتر و کاغذ ",
            "     خودکار و روان نویس ",
            "    ابزار نقاشی و رنگ آمیزی ",
            "    میز تحریر   ",
            "    آلبوم عکس    ",
            "   کاغذ چاپ و پرینتر     ",
            "  مداد و مداد رنگی      ",
          ],
        },
        {
          title: " صنایع دستی     ",
          items: [
            "کالا های مس",
            " سفال ، سرامیک و چینی",
            "کیف چرمی",
            "ترمه، قلمکار و دستباف",
            "خاتم ،منبت،حصیری و چوبی",
            "تابلو و ساعت",
            "مینا کاری",
            "فیروزه کوبی",
            "سوزن دوزی",
            "   محصولات استخوانی ",
            "   جعبه و دست سازه های هنری ",
          ],
        },
        {
          title: "  آلات موسیقی     ",
          items: [
            " لوازم جانبی آلات موسیقی ",
            "  گیتار",
            "  کیبورد و ارگ",
            "  پیانو دیجیتال",
            "  درام ،پرکاشن ،دف",
            "  تجهیزات استودیویی",
            "  ویولن",
            "  سازهای ایرانی",
          ],
        },
        {
          title: "  محتوای آموزشی      ",
          items: [
            " آموزش موسیقی ",
            " آموزش ورزش و سرگرمی ",
            " آموزش زبان ",
            " آموزش نرم افزار و کامپیوتر ",
          ],
        },
        {
          title: "  فرش ماشینی، دستباف ، تابلو       ",
          items: ["  فرش ماشینی ", "  فرش دستباف ", " تابلو  "],
        },
        {
          title: "  کتاب و مجله     ",
          items: ["  کتاب چاپی  ", "  مجلات خارجی و داخلی  "],
        },
        {
          title: "   نرم افزار     ",
          items: [],
        },
        {
          title: "   بازی کنسول و کامپیوتر      ",
          items: [],
        },
        {
          title: "   فیلم سینمایی ، سریال و مستند     ",
          items: [],
        },
        {
          title: " آلبوم موسیقی     ",
          items: [],
        },
      ],
    },

    {
      title: "کالای دیجیتال",
      logo: <CiLaptop size={20} />,
      id: 3,
      detailMenu: [
        {
          title: "برند های برتر  ",
          items: [
            "   اپل   ",
            "   سامسونگ   ",
            "   هوآوی   ",
            "   آنر   ",
            "   ردمی   ",
            "شیائومی",
            "ریلمی",
            "توشیبا",
            "تکنو",
            "ایرانسل",
            "مبین نت",
            "نینتندو",
            "بیتس",
            "جی بی ال",
            "وان مور",
            "تی پی لینک",
            "دی لینک",
            "کیو سی وای",
          ],
        },

        {
          title: "    تجهیزات شبکه و ارتباطات   ",
          items: [
            "یو پی اس (ups)",
            "سوییچ",
            "پچ پنل",
            "اکسس پوینت",
            "هاب USB",
            "کابل شبکه",
            "کارت شبکه",
            "سیم آنتن",
            "اسپلیتر",
          ],
        },
        {
          title: "  دوربین     ",
          items: [
            "دوربین فیلم برداری",
            "دوربین کنون",
            "دوربین سونی",
            "دوربین چاپ سریع",
            "رینگ لایت",
            "پایه دوربین",
            "لنز دوربین",
            "کارت حافظه",
          ],
        },
        {
          title: "    لپ تاپ   ",
          items: [
            "لپ تاپ ایسوس",
            "لپ تاپ لنوو",
            "مک بوک",
            "لپ تاپ HP",
            "لپ تاپ دل",
            "لپ تاپ ایسر",
            "لپ تاپ ام اس آی",
            "لپ تاپ کاستوم",
          ],
        },
        {
          title: "    هدفون   ",
          items: [
            "  هدفون بی سیم",
            "  هدفون اپل(ایرپاد)",
            " هدفون بیتس ",
            "  هدفون  سونی",
            "  هدفون سامسونگ (ایرپادز)",
            "  هدفون  شیائومی",
            "  هدفون  جی بی ال",
            " هدفون ریزر",
          ],
        },
        {
          title: "      ماشین های اداری ",
          items: [
            "کابل پرینتر",
            "کارتریج",
            "اسکنر",
            "تلفن",
            "بارکدخوان",
            "ویدئو وال",
            "ویدئو پروژکتور",
            "دستگاه حضور و غیاب",
          ],
        },
        {
          title: "    ساعت و مچ بند هوشمند   ",
          items: [
            "  ساعت هوشمند سامسونگ ",
            "  ساعت هوشمند شیائومی ",
            "    اپل واچ ",
            "بند اپل واچ ",
            "بند  ساعت هوشمند ",
            "لوازم جانبی ساعت هوشمند ",
          ],
        },
        {
          title: "   اسپیکر    ",
          items: [
            "اسپیکر بلوتوثی ",
            "اسپیکر jbl ",
            "اسپیکر هارمن کاردن ",
            " اسپیکر سونی",
            "اسپیکر مکسیدر ",
            " پارتی باکس",
          ],
        },

        {
          title: "    کامپیوتر   ",
          items: [
            "all in one",
            "mini pc",
            "قلم نوری",
            "رم ریدر",
            "ماوس پد",
            "کیس اسمبل شده",
          ],
        },
        {
          title: "    پاور بانک   ",
          items: [
            " فست شارژر",
            "پاور بانک شیائومی",
            "پاور بانک انکر",
            "پاور بانک اپل",
            "پاور بانک سامسونگ",
            "پاور بانک انرجایزر",
          ],
        },
        {
          title: "پرینتر       ",
          items: [
            "پرینتر سه بعدی",
            "پرینتر حرارتی",
            "پرینتر رنگی",
            "پرینتر لیبل زن",
            " پرینتر اچ پی",
          ],
        },
        {
          title: "    خانه هوشمند   ",
          items: [
            "نور و روشنایی هوشمند",
            "کلید  و پریز هوشمند",
            "سنسور هوشمند",
            "هاب و دستیار صوتی هوشمند",
            "جارو هوشمند (رباتیک)",
          ],
        },
        {
          title: " لوازم جانبی لپ تاپ      ",
          items: ["شارژر لپ تاپ", "کیف لپتاپ", "کول پد ", " استیکر لپ تاپ "],
        },
        {
          title: "  قطعات کامپیوتر     ",
          items: ["پردازنده (cpu) ", "کارت گرافیک", "مادربرد", "دانگل بلوتوث"],
        },
        {
          title: "    کیبورد   ",
          items: ["کیبورد گیمینگ", "کیبورد بی سیم", "کیبورد مکانیکال"],
        },

        {
          title: "    کنسول بازی    ",
          items: ["ps5", "xbox", "ps4"],
        },
        {
          title: "  وسایل گیمینگ     ",
          items: ["دسته بازی", "فرمان بازی", "دیسک های بازی"],
        },
        {
          title: "  تجهیزات زخیره سازی     ",
          items: ["هارد ssd", "هارد اینترنال", "هارد اکسترنال"],
        },

        {
          title: "     فلش  ",
          items: ["فلش 256 گیگ", "فلش 128 گیگ", "فلش 64 گیگ"],
        },
        {
          title: "    مودم   ",
          items: ["مودم جیبی", "مودم ایرانسل", "مودم همراه اول"],
        },

        {
          title: "     داغ ترین ها  ",
          items: ["گیمینگ", "هدفون گربه ای", "فیفا"],
        },
        {
          title: "   ماوس    ",
          items: ["ماوس گیمینگ", "ماوس بی سیم"],
        },

        {
          title: "   باتری    ",
          items: [" باتری لیتیومی", "باتری قلمی"],
        },
        {
          title: "    تجهیزات امنیتی و نظارتی   ",
          items: ["دوربین مدار بسته"],
        },
        {
          title: "     کیس کامپیوتر  ",
          items: ["کیس گیمینگ"],
        },

        {
          title: "      مانیتور ",
          items: ["مانیتور گیمینگ"],
        },

        {
          title: "    رم کامپیوتر   ",
          items: [],
        },
        {
          title: "    هدست   ",
          items: [],
        },
        {
          title: "   تبلت    ",
          items: [],
        },
      ],
    },
    {
      title: "خانه و آشپزخانه",
      logo: <GiSofa size={20} />,
      id: 4,
      detailMenu: [
        {
          title: "ظروف پخت و پز    ",
          items: ["    قابلمه و تابه  ", "    زودپز  ", "    سرویس پخت و پز  "],
        },
        {
          title: "   ابزار آشپزی ",
          items: [
            "    ست کفگیر و ملاقه  ",
            "    چاقو  ",
            "    تخته گوشت   ",
            "   ظرف و قالب یخ    ",
            "  قیف     ",
            "    صافی   ",
            "    فندک آشپزخانه   ",
            "   ترازوی آشپزخانه    ",
          ],
        },
        {
          title: "  تهیه و سرو چای و قهوه  ",
          items: [
            "   قهوه ساز و دمنوش ساز    ",
            " سماور     ",
            "   شیرجوش - قهوه جوش    ",
            "    قوری   ",
            "  کتری و قوری     ",
            "   فیلتر چای   ",
          ],
        },
        {
          title: "  ظروف آشپزخانه  ",
          items: [
            "  آبکش و آبگیر     ",
            "     بطری ",
            "    ارگانایزر آشپزخانه   ",
            "   جای ادویه    ",
            "  بانکه و ظروف نشکن     ",
            "  شکر پاش و نمک پاش     ",
            "   سبد آشپزخانه    ",
            "    سبد سیب زمینی و پیاز   ",
            "     ظرف نگدارنده  ",
            "   سایر ظروف    ",
          ],
        },
        {
          title: "  لوازم تهیه کیک و دسر  ",
          items: [],
        },
        {
          title: "  سرو و پذیرایی  ",
          items: [
            "    سفره   ",
            "   ماگ   ",
            "     سینی  ",
            "   لیوان    ",
            "    بشقاب   ",
            "  قندان     ",
            "    پارچ و بطری   ",
            "   بستنی خوری    ",
            "    سس خوری و آبلیمو خوری   ",
            "    کاسه و پیاله   ",
            "    کلمن و فلاسک   ",
            "    ظروف سرو و پذیرایی   ",
            "   سرویس غذاخوری    ",
            "   قاشق ، چنگال و کارد    ",
            "  زیر لیوانی ، زیر بشقابی و زیر قابلمه ای     ",
            "   ابزار مهمانی    ",
          ],
        },
        {
          title: "منسوجات آشپزخانه  ",
          items: [
            "  دستگیره      ",
            "  پیش بند    ",
            "   کیسه نان و سبزی    ",
            "     دستمال نظافت خانه و آشپزخانه  ",
          ],
        },
        {
          title: " مبلمان و دکوراسیون خانگی   ",
          items: [
            "   پاف و بین بگ    ",
            "   مبل   ",
            "    کتابخانه   ",
            "   شلف و طبقه    ",
            "  کنسول      ",
            "  صندلی     ",
            "    میز ناهار خوری   ",
          ],
        },
        {
          title: " مبلمان و دکوراسیون اداری  ",
          items: ["  صندلی اداری     ", "  میز اداری    "],
        },
        {
          title: "    نگهدارنده لباس و لوازم",
          items: [
            "    کمد لباس و ارگانایزر   ",
            " جا کفشی     ",
            "   جا لباسی    ",
            "      کاوری لوازم خانگی ",
          ],
        },
        {
          title: "   دکوراتیو ",
          items: [
            "     مجسمه و تندیس  ",
            "  ساعت    ",
            "   عود    ",
            " شمع      ",
            "      شمعدان ",
            "   دیوارکوب    ",
            "     اسماج  ",
            "     گل و گلدان  ",
            "  آینه دکوراتیو     ",
          ],
        },
        {
          title: "  قاب عکس و تابلو  ",
          items: ["   تابلو    ", "   قاب عکس   ", "  تابلو شاسی     "],
        },
        {
          title: "  کوسن ، رومیزی و شال مبل  ",
          items: ["    رومیزی   ", "   کوسن   ", "  شال مبل و تخت     "],
        },
        {
          title: " کفپوش و دیوارپوش   ",
          items: [
            "   پوستر و کاغذ دیواری    ",
            "   پارکت   ",
            " استیکر و پوستر      ",
            "  پرده     ",
            "   ملزومات پرده    ",
          ],
        },
        {
          title: "  نور و روشنایی  ",
          items: [" آباژور      ", "    لوستر  ", "   لامپ و چراغ    "],
        },
        {
          title: "   فرش و گلیم ",
          items: [
            "   فرش    ",
            "    موکت  ",
            "  تابلو فرش     ",
            "پادری",
            "روفرشی",
          ],
        },
        {
          title: "گل و گیاه    ",
          items: ["    گل آپارتمانی   ", "  دسته گل    ", "     سبد گل  "],
        },
        {
          title: "   حمام ",
          items: [
            "    حوله   ",
            "  دمپایی    ",
            "     لیف  ",
            "  پرده حمام     ",
            "     وان و جکوزی  ",
            "   ابزار حمام    ",
          ],
        },
        {
          title: "   سرویس بهداشتی ",
          items: [
            "    توالت فرنگی   ",
            "  ست سرویس بهداشتی    ",
            "  روشویی     ",
            "جامسواکی",
            "آینه سرویس بهداشتی",
            "فلاش تانک",
            "مخزن مایع دستشویی",
            "پایه رول دستمال",
            "توالت ایرانی",
            "آفتابه",
          ],
        },
        {
          title: "خواب    ",
          items: [
            "   لحاف    ",
            "     روتختی ",
            "   سرویس خواب    ",
            "ملحفه",
            "بالش",
            "تشک",
            "روبالشی",
            "تشک خوشخواب",
            "پتو",
          ],
        },
        {
          title: " شستشو و نظافت   ",
          items: [
            "  سطل     ",
            " تی (زمین شوی)     ",
            "     فرچه  ",
            "جارو و خاک انداز       ",
          ],
        },
        {
          title: " نظافت لباس   ",
          items: [
            "   پرزگیز لباس    ",
            "  گیره لباس    ",
            "     کاورپوشاک  ",
            "  کیسه وکیوم     ",
            "  سبد رخت چرک     ",
            "     بند رخت  ",
            "       ",
            "    میز اتو   ",
            " لوازم جانبی اتو ",
          ],
        },
      ],
    },
    {
      title: " لوازم خانگی برقی",
      logo: <CgSmartHomeRefrigerator size={20} />,
      id: 5,
      detailMenu: [
        {
          title: " صوتی و تصویری",
          items: [
            "تلویزیون",
            "ساندبار",
            "ویدئو پروژکتور",
            "پخش کننده خانگی",
            "لوازم جانبی صوتی و تصویری",
            "ریموت کنترل",
          ],
        },
        {
          title: "تهویه ،سرمایش و گرمایش ",
          items: [
            "پنکه",
            "کولر آبی",
            "کولر گازی",
            "بخاری",
            "بخاری برقی",
            "تصفیه کننده هوا",
            "پکیج دیواری و رادیاتور",
            "آبگرمکن",
            "شوفاژ برقی",
          ],
        },
        {
          title: " لوازم پخت و پز ",
          items: [
            "  سرخ کن بدون روغن (airfrier)",
            " میکروویو ،ماکروفر ",
            "اجاق گاز  ",
            "  پلوپز",
            "ساندویچ ساز و وافل ساز  ",
            "  آون توستر",
            "گریل و باربیکیو  ",
            "  توستر",
          ],
        },

        {
          title: " نوشیدنی ساز ",
          items: [
            "  قهوه ساز",
            "اسپرسو ساز  ",
            " چای ساز ",
            " کتری برقی ",
            " سماور برقی ",
            "  آبمیوه گیر",
            "  آب مرکبات گیر",
            "  آسیاب قهوه",
          ],
        },

        {
          title: "  خردکن و غذاساز",
          items: [
            "  گوشت کوب برقی",
            "  غذاساز",
            "  همزن",
            " مخلوط کن",
            " چرخ گوشت ",
            " خردکن ",
            " آسیاب ",
          ],
        },
        {
          title: " یخچال فریزر",
          items: [
            "یخچال فریزر ساید بای ساید",
            "یخچال فریزر دوقولو",
            "یخچال فریزر هتلی",
            "یخچال فریزر کمپی",
          ],
        },

        {
          title: " ماشین لباسشویی",
          items: [
            "ماشین لباسشویی دوو",
            " ماشین لباس شویی پاکشوما",
            "ماشین لباس شویی اسنوا",
            "مینی واش   ",
          ],
        },

        {
          title: " لوازم توکار ",
          items: [" فر   ", "    هود", "   گاز صفحه ای ", " سینگ ظرفشویی   "],
        },

        {
          title: "اتو ",
          items: ["اتو بخار ایستاده", "اتو بخار", "بخارگر"],
        },

        {
          title: "جاروبرقی ",
          items: ["جارو شارژی", "لوازم جانبی جارو برقی و بخارشوی"],
        },
        {
          title: " چرخ خیاطی",
          items: ["چرخ خیاطی زانومه", "چرخ خیاطی کاچیران"],
        },

        {
          title: "تصفیه آب ",
          items: ["فیلتر تصفیه آب"],
        },
        {
          title: "بخارشو ",
          items: [],
        },
        {
          title: "ماشین ظرفشویی ",
          items: [],
        },
      ],
    },
    {
      title: "مد و پوشاک",
      logo: <GiClothes size={20} />,
      id: 6,
      detailMenu: [
        {
          title: "پوشاک مردانه  ",
          items: [],
        },
        {
          title: " لباس مردانه ",
          items: [
            "تی شرت مردانه",
            "پیراهن مردانه",
            "سویشرت مردانه",
            "ژاکت و پلیور مردانه",
            "هودی مردانه",
          ],
        },
        {
          title: " پالتو ،بارونی و کاپشن مردانه ",
          items: [
            "پالتو مردانه",
            "کاپشن مردانه",
            "کت چرم مردانه",
            "پافر مردانه",
          ],
        },
        {
          title: "  کت ، جلیقه و ست رسمی مردانه",
          items: ["کت تک مردانه", "کت شلوار مردانه", "جلیقه مردانه"],
        },
        {
          title: " شلوار و ست سرهمی مردانه ",
          items: [
            "شلوار جین مردانه",
            "لباس راحتی مردانه",
            "شلوارک مردانه",
            "جوراب مردانه",
          ],
        },
        {
          title: " کیف مردانه ",
          items: ["کیف پول مردانه"],
        },
        {
          title: " کفش مردانه ",
          items: [
            "کفش اسپورت مردانه",
            "بوت مردانه",
            "نیم بوت مردانه",
            "کفش کالج مردانه",
          ],
        },
        {
          title: " اکسسوری مردانه ",
          items: [
            "عینک مردانه",
            "کمربند و ساسبند مردانه",
            "کلاه مردانه",
            "کراوات و پاپیون مردانه",
          ],
        },
        {
          title: " ورزشی مردانه ",
          items: [
            "لباس ورزشی مردانه",
            "مایو مردانه",
            "گرمکن و ست ورزشی مردانه",
            "اکسسوری ورزشی مردانه",
            "کفش ورزشی مردانه",
          ],
        },
        {
          title: "  پک هدیه مردانه",
          items: [],
        },
        {
          title: " پک هدیه مردانه ",
          items: ["زیرپوش مردانه", "شورت مردانه"],
        },
        {
          title: "  پوشاک زنانه",
          items: [],
        },
        {
          title: "لباس زنانه  ",
          items: [
            "پیراهن و لباس مجلسی زنانه",
            "هودی زنانه",
            "سویشرت زنانه",
            "دامن زنانه",
            "شلوار جین زنانه",
            "شلوارک زنانه",
            "لگ زنانه",
          ],
        },
        {
          title: "لباس خواب و راحتی زنانه  ",
          items: ["لباس خواب زنانه"],
        },
        {
          title: "  بلوز و شومیز زنانه",
          items: [
            "بادی زنانه",
            "ژاکت و پلیور زنانه",
            "تاپ و نیم تنه زنانه",
            "تونیک زنانه",
            "تیشرت زنانه",
          ],
        },
        {
          title: " پالو ،بارونی و کاپشن زنانه ",
          items: [
            "کاپشن زنانه",
            "پالتو زنانه",
            "کت چرم زنانه",
            "بارانی زنانه",
            "پافر زنانه",
          ],
        },
        {
          title: " کت، جلیقه و ست رسمی زنانه ",
          items: [],
        },
        {
          title: "  لباس بارداری",
          items: ["شلوار و سرهمی بارداری", "پیراهن و لباس مجلسی بارداری"],
        },
        {
          title: " لباس زیر زنانه  ",
          items: [" شورت زنانه ", "سوتین"],
        },
        {
          title: "  مقنعه و پوشیه ",
          items: [],
        },
        {
          title: " مانتو زنانه  ",
          items: [],
        },
        {
          title: "  ورزشی زنانه ",
          items: [],
        },

        {
          title: "  لباس ورزشی زنانه ",
          items: [
            " گرمکن و ست ورزشی زنانه ",
            "تاپ و نیم تنه ورزشی زنانه",
            "شلوار و سرهمی ورزشی زنانه",
            "مایو زنانه",
          ],
        },

        {
          title: " کفش زنانه  ",
          items: [
            " کفش اسپورت زنانه ",
            "کفش کالج زنانه",
            "بوت زنانه",
            "نیم بوت زنانه",
            "صندل زنانه",
            "دمپایی زنانه",
          ],
        },

        {
          title: "  کیف زنانه ",
          items: [],
        },

        {
          title: "  اکسسوری زنانه ",
          items: [" ساعت زنانه ", "عینک زنانه", "کمربند زنانه"],
        },
        {
          title: "   ست هدیه زنانه",
          items: [],
        },
        {
          title: "   پوشاک بچه",
          items: [],
        },
        {
          title: "  لباس دخترونه ",
          items: [" بلوز و شومیز دخترانه "],
        },
        {
          title: "  پالتو ، بارانی و کاپشن دخترانه ",
          items: [
            "  کاپشن دخترانه",
            "پالتو دخترانه",
            "کت، جلیقه و ست رسمی دخترانه",
            "سویشرت و هودی دخترانه",
            "جوراب و ساق دخترانه",
            "لباس راحتی دخترانه",
            "مانتو دخترانه",
            "چادر دخترانه",
            "سارافن دخترانه",
            "شلوار و سرهمی جین دخترانه",
          ],
        },
        {
          title: "  لباس زیر دخترانه ",
          items: ["  سوتین دخترانه", "شورت دخترانه"],
        },
        {
          title: "  اکسسوری دخترانه ",
          items: [" شال و روسری دخترانه ", "کلاه دخترانه", "عینک دخترانه"],
        },
        {
          title: " کیف دخترانه  ",
          items: [],
        },
        {
          title: " کفش دخترانه  ",
          items: [
            " کفش اسپورت دخترانه ",
            "کفش مجلسی دخترانه",
            "بوت دخترانه",
            "نیم بوت دخترانه",
          ],
        },
        {
          title: "لباس پسرانه   ",
          items: [" تیشرت پسرانه ", "شلوار پسرانه", "سویشرت و هودی پسرانه"],
        },
        {
          title: "    پالتو ، بارانی و کاپشن پسرانه",
          items: ["  کاپشن پسرانه "],
        },
        {
          title: "   لباس زیر پسرانه ",
          items: [" شورت پسرانه   "],
        },
        {
          title: " کیف پسرانه   ",
          items: ["  کوله پشتی پسرانه  "],
        },
        {
          title: "  کفش پسرانه  ",
          items: [],
        },
        {
          title: " اکسسوری پسرانه   ",
          items: ["  کلاه پسرانه  "],
        },
        {
          title: " ورزشی پسرانه   ",
          items: ["  مایو پسرانه  ", "لباس ورزشی پسرانه"],
        },
        {
          title: "   پوشاک نوزاد ",
          items: [],
        },
        {
          title: "   لباس نوزاد ",
          items: ["  سرهمی نوزاد  ", "لباس بافتنی نوزاد"],
        },
        {
          title: "  کفش نوزاد  ",
          items: [],
        },
        {
          title: "   اکسسوری نوزاد  ",
          items: [],
        },
        {
          title: "   برند هامتو  ",
          items: [],
        },
        {
          title: " برند چرم مشهد    ",
          items: [],
        },
        {
          title: " برند اسمارا    ",
          items: [],
        },
        {
          title: "  برند اچ اند ام   ",
          items: [],
        },
        {
          title: "  برند چرم عطارد   ",
          items: [],
        },
        {
          title: "  شلوار پلنگی   ",
          items: [],
        },
        {
          title: "   شلوار بگ  ",
          items: [],
        },
        {
          title: "   شلوار مام استایل  ",
          items: [],
        },
        {
          title: "    شلوار کارگو ",
          items: [],
        },
        {
          title: "  شلوار دمپا   ",
          items: [],
        },
        {
          title: "   شلوار زاپ دار  ",
          items: [],
        },
        {
          title: "  شلوار مام فیت   ",
          items: [],
        },
      ],
    },
    {
      title: "ساعت، طلا و جواهر ",
      logo: <GiNecklaceDisplay size={20} />,
      id: 7,

      detailMenu: [
        {
          title: "شمش و پلاک طلا   ",
          items: [],
        },
        {
          title: " سکه طلا  ",
          items: [],
        },
        {
          title: "  طلای آب شده ",
          items: [],
        },
        {
          title: "  زیورآلات طلا زنانه ",
          items: [
            "زنجیر طلا زنانه",
            "انگشتر طلا زنانه",
            "دستبند طلا زنانه",
            "النگو طلا زنانه",
            "گردنبند طلا زنانه",
            "گوشواره طلا",
            "پابند طلا",
            "گل سینه طلا زنانه",
            "ست زیورآلات طلا زنانه",
            "آویز طلا زنانه",
            "پیرسینگ طلا زنانه",
            "آویز ساعت طلا زنانه",
            "جا کلیدی طلا زنانه",
          ],
        },
        {
          title: " زیورآلات طلا مردانه  ",
          items: [
            "انگشتر طلا مردانه",
            "زنجیر طلا مردانه",
            "گردنبند طلا مردانه",
            "دستبند طلا مردانه",
            "ست زیورآلات طلا مردانه",
            "دکمه سردست طلا مردانه",
            "جاکلیدی طلا مردانه",
          ],
        },
        {
          title: "  زیورآلات طلا زنانه و مردانه ",
          items: [],
        },
        {
          title: "   زیورآلات طلا بچگانه",
          items: [],
        },
        {
          title: " زیورآلات طلا دخترانه  ",
          items: [
            "دستبند طلا دخترانه",
            "گوشواره طلا دخترانه",
            "ست زیورآلات طلا دخترانه",
            "گردنبند طلا دخترانه",
            "آویز طلا دخترانه",
            "انگشتر طلا دخترانه",
          ],
        },
        {
          title: "  زیورآلات طلا پسرانه ",
          items: [],
        },
        {
          title: " زیورآلات طلا دخترانه و پسرانه  ",
          items: ["گل سینه طلا دخترانه و پسرانه"],
        },
        {
          title: "   زیورآلات نقره زنانه",
          items: [
            "زنجیر نقره زنانه",
            "انگشتر نقره زنانه",
            "دستبند نقره زنانه",

            "گردنبند نقره زنانه",
            "گوشواره نقره",
            "پابند نقره",
            "گل سینه نقره زنانه",
            "ست زیورآلات نقره زنانه",
            "آویز نقره زنانه",
            "پیرسینگ نقره زنانه",
            "آویز ساعت نقره زنانه",
          ],
        },
        {
          title: " زیورآلات نقره مردانه  ",
          items: [
            "انگشتر نقره مردانه",
            "زنجیر نقره مردانه",
            "گردنبند نقره مردانه",
            "دستبند نقره مردانه",
          ],
        },
        {
          title: " زیورآلات جنس نقره زنانه و مردانه  ",
          items: ["گل سینه نقره زنانه و مردانه"],
        },
        {
          title: "  ساعت ",
          items: [],
        },
        {
          title: "   ساعت مردانه",
          items: ["ساعت عقربه ای مردانه"],
        },
        {
          title: "   ساعت زنانه",
          items: ["ساعت عقربه ای زنانه", "ساعت دیجیتال زنانه"],
        },
        {
          title: "   ساعت پسرانه",
          items: [],
        },
        {
          title: "   ساعت دخترانه",
          items: [],
        },
        {
          title: "   زیورآلات زنانه",
          items: [
            "زنجیر زنانه",
            "انگشتر زنانه",
            "دستبند زنانه",

            "گردنبند زنانه",
            "گوشواره زنانه",
            "پابند زنانه",
            "گل سینه زنانه",
          ],
        },
        {
          title: "   زیورآلات مردانه",
          items: [
            "زنجیر مردانه",
            "انگشتر مردانه",
            "دستبند مردانه",
            "گردنبند مردانه",
            "گوشواره مردانه",
            "پابند مردانه",
            "گل سینه مردانه",
          ],
        },
        {
          title: " زیورآلات نقره زنانه و مردانه  ",
          items: ["پیرسینگ زنانه و مردانه", "انگشتر زنانه و مردانه"],
        },
        {
          title: "   زیورآلات دخترانه",
          items: [
            "زنجیر دخترانه",
            "انگشتر دخترانه",
            "دستبند دخترانه",

            "گردنبند دخترانه",
            "گوشواره دخترانه",
          ],
        },
        {
          title: "   پارسیس (Parsis)",
          items: [],
        },
        {
          title: "   مستجابی (Mostajabi)",
          items: [],
        },
        {
          title: "   مایاماهک (maya mahak)",
          items: [],
        },
        {
          title: "   کرابو (Kerabo)",
          items: [],
        },
        {
          title: "   ماوی گالری (Mavi gallery)",
          items: [],
        },
        {
          title: "   تاج (Taj)",
          items: [],
        },
        {
          title: "   کاکامی (Kakami)",
          items: [],
        },
        {
          title: "   کاپانی (Kapani)",
          items: [],
        },
        {
          title: "   جواهری سون (Se7en jewerly)",
          items: [],
        },
        {
          title: "  سین سان (Seen san)",
          items: [],
        },
        {
          title: "   خانه سکه ایران  (Iran Coin House)",
          items: [],
        },
        {
          title: "   پرسته  (Parasteh)",
          items: [],
        },
        {
          title: "   دوست خوب  (doust khob)",
          items: [],
        },
        {
          title: "   الن نار   (Elen Nar)",
          items: [],
        },
        {
          title: "   سهی   (Sahi)",
          items: [],
        },
        {
          title: "   مانچو   (Mancho)",
          items: [],
        },
        {
          title: "   پولک   (Polak)",
          items: [],
        },
      ],
    },
    {
      title: " آرایشی  بهداشتی",
      logo: <BsFillBagHeartFill size={20} />,
      id: 8,
      detailMenu: [
        {
          title: "  لوازم آرایشی ",
          items: [
            "آرایش صورت",
            "آرایش چشم",
            "آرایش ابرو",
            "آرایش لب",
            "بهداشت و زیبایی ناخن ",
            "ابزار آرایشی",
          ],
        },
        {
          title: "   مراقبت پوست ",
          items: [
            "کرم ضد آفتاب",
            "کرم مرطوب کننده و نرم کننده",
            "ماسک صورت و بدن",
            "پاک کننده صورت",
            "تونر",
            "مراقبت بدن",
            "ابزار مراقبت پوست",
          ],
        },
        {
          title: "   مراقبت و زیبایی مو ",
          items: ["شامپو و مراقبت مو", "آرایش مو"],
        },
        {
          title: "  لوازم بهداشتی  ",
          items: [
            "مراقبت دهان و دندان",
            "مسواک",
            "خمیر دندان",
            "دئودرانت و ضد تعریق",
            "محصولات بهداشت جنسی",
            "کاندوم",
            "بهداشت و مراقبت شخصی",
            "نوار بهداشتی",
            "کاپ قاعدگی",
            "لوازم اصلاح مو",
            "تیغ و یدک اصلاح",
          ],
        },
        {
          title: "   عطر و ادکلن ",
          items: [
            "عطر و ادکلن زنانه",
            "عطر و ادکلن مردانه",
            "بادی اسپلش",
            "عطر جیبی",
          ],
        },
        {
          title: "  لوازم شخصی برقی  ",
          items: [
            "سشوار",
            "اتو و حالت دهنده ی مو",
            "اصلاح موی صورت",
            "اصلاح موی سر",
          ],
        },
      ],
    },
    {
      title: "تجهیزات پزشکی و سلامت ",
      logo: <FaBriefcaseMedical size={20} />,
      id: 9,
      detailMenu: [
        {
          title: "  تجهیزات پزشکی  ",
          items: [
            "کنترل دیابت",
            "تجهیزات پزشکی تنفسی",
            "تجهیزات پزشکی حرفه ای",
            "لوازم پزشکی",
            "ماساژور",
            "فشارسنج",
            "ترازو",
            "پد و کیسه آب گرم",
            "تشک و پتوی برقی",
            "تب سنج و دماسنج",
            "دماسنج محیطی",
            "دستگاه های عمومی پزشکی",
            "لوازم جانبی پزشکی",
            "سلامت محیط",
            "کیسه نمک -درد",
            "رطوبت گیر",
          ],
        },
        {
          title: "  مکمل غذایی  ",
          items: [],
        },
        {
          title: "  مکمل ورزشی  ",
          items: [
            "پروتئین",
            "آمینواسید",
            "کراتین",
            "مکمل افزایش وزن",
            "مکمل کاهش وزن",
          ],
        },
        {
          title: "    ارتوپدی و کمک درمانی",
          items: [],
        },
        {
          title: "  لوازم پزشکی مصرفی  ",
          items: [],
        },
        {
          title: "تجهیزات دندانپزشکی   ",
          items: [],
        },
      ],
    },
    {
      title: "ورزش و سفر ",
      logo: <GiCampingTent size={20} />,
      id: 10,
      detailMenu: [
        {
          title: "  پوشاک ورزشی مردانه   ",
          items: [],
        },
        {
          title: " پوشاک ورزشی زنانه    ",
          items: [],
        },
        {
          title: "  کفش ورزشی مردانه   ",
          items: [],
        },
        {
          title: "  کفش ورزشی زنانه  ",
          items: [],
        },
        {
          title: "  پوشاک ورزشی پسرانه   ",
          items: [],
        },
        {
          title: "  پوشاک ورزشی دخترانه   ",
          items: [],
        },
        {
          title: "  کفش ورزشی  پسرانه  ",
          items: [],
        },
        {
          title: "    کفش ورزشی دخترانه   ",
          items: [],
        },
        {
          title: "    تجهیزات سفر   ",
          items: ["ساک و چمدان", "کیف و کوله پشتی"],
        },
        {
          title: "      دوچرخه ",
          items: ["لوازم جانبی دوچرخه"],
        },
        {
          title: "     کوهنوردی و کمپینگ  ",
          items: [
            "کفش کوهنوردی",
            "عصای کوهنوردی",
            "چراغ قوه و چراغ پیشانی",
            "چاقو و ابزار چند کاره",
            "قمقمه و فلاسک",
            "چادر",
            "کیسه خواب",
            "زیرانداز سفری",
            "تجهیزات جانبی سفر و کمپینگ",
          ],
        },
        {
          title: "   چتر    ",
          items: [],
        },
        {
          title: "   ساک ورزشی    ",
          items: [],
        },
        {
          title: "     قمقمه و شیکر ",
          items: [],
        },
        {
          title: " لوازم ورزشی      ",
          items: [],
        },
        {
          title: "  ورزش های هوازی و بدنسازی     ",
          items: [
            "تجهیزات جانبی ایروبیک و تناسب اندام",
            "دمبل",
            "طناب",
            "بارفیکس",
            "تردمیل",
            "لوازم پوششی و محافظتی",
          ],
        },
        {
          title: "   ورزش های توپی    ",
          items: ["توپ", "راکت"],
        },
        {
          title: "   ورزش های آبی    ",
          items: [],
        },
        {
          title: "    ورزش های رزمی   ",
          items: [],
        },
        {
          title: "    اسکوتر برقی   ",
          items: [],
        },
        {
          title: "    اسکیت و اسکوتر    ",
          items: [],
        },
      ],
    },
    {
      title: " کارت هدیه",
      logo: <BiCreditCard size={20} />,
      id: 11,
      detailMenu: [
        {
          title: "   کارت هدیه فیزیکی دیجی کالا ",
          items: [],
        },
        {
          title: "   کارت هدیه بر اساس مناسبت   ",
          items: [
            "  کارت هدیه تولد  ",
            "  کارت هدیه  روز مادر ",
            "  کارت هدیه روز معلم  ",
            "  کارت هدیه سالگرد  ",
            "  کارت هدیه تشکر  ",
            "  کارت هدیه دوستی  ",
            "  کارت هدیه ازدواج  ",
            "  کارت هدیه نوزاد  ",
            "  کارت هدیه خانه نو  ",
            "  کارت هدیه فارغ تحصیلی  ",
            "  کارت هدیه عید نوروز  ",
          ],
        },
        {
          title: "   کارت هدیه بر اساس قیمت   ",
          items: [
            "   کارت هدیه تا 500 هزار تومان ",
            "  کارت هدیه از 500 هزار تومان تا 2 میلیون تومان  ",
            "  کارت هدیه از 2 میلیون تومان تا 4 میلیون تومان  ",
            "  کارت هدیه از 4 میلیون تومان تا 6 میلیون تومان  ",
            "  کارت هدیه از 6 میلیون تومان تا 8 میلیون تومان  ",
            "  کارت هدیه از 8 میلیون تومان تا 10 میلیون تومان  ",
          ],
        },
        {
          title: "     کارت هدیه الکترونیکی دیجی کالا ",
          items: [],
        },
        {
          title: "     کارت هدیه الکترونیکی  بر اساس مناسبت ",
          items: [
            "   کارت هدیه الکترونیکی تولد",
            "   کارت هدیه الکترونیکی روز معلم",
            "   کارت هدیه الکترونیکی سالگرد",
            "   کارت هدیه الکترونیکی تشکر",
            "   کارت هدیه الکترونیکی عذرخواهی",
            "   کارت هدیه الکترونیکی دوستی",
            "   کارت هدیه الکترونیکی ازدواج",
            "   کارت هدیه الکترونیکی نوزاد",
            "   کارت هدیه الکترونیکی خانه نو",
            "   کارت هدیه الکترونیکی فارغ تحصیلی",
            "   کارت هدیه الکترونیکی عید نوروز",
          ],
        },
        {
          title: "     کارت هدیه سازمانی",
          items: [],
        },
        {
          title: "     کارت هدیه مد و پوشاک",
          items: [],
        },
        {
          title: "     کارت هدیه اکسسوری مد و پوشاک",
          items: [],
        },
        {
          title: "     کارت هدیه دیجی استایل",
          items: [],
        },
        {
          title: "     کارت هدیه فیدیبو",
          items: [],
        },
        {
          title: "     گیفت کارت  اپلیکیشن و نرم افزار ",
          items: [],
        },
        {
          title: "     گیفت کارت پلتفرم های آنلاین ",
          items: [],
        },
        {
          title: "     گیفت کارت پرداخت های درون بازی ",
          items: [],
        },
        {
          title: "     گیفت کارت فروشگاه آنلاین ",
          items: [],
        },
        {
          title: "     گیفت کارت فیلم و سریال ",
          items: [],
        },
      ],
    },
    {
      title: "کالاهای سوپرمارکتی",
      logo: <GiMilkCarton size={20} />,
      id: 12,
      detailMenu: [
        {
          title: "   کالاهای اساسی و خواربار     ",
          items: [
            "نان",
            "ماکارونی",
            "برنج",
            "نبات",
            "قند",
            "شکر",
            "رب گوجه",
            "رب انار",
          ],
        },
        {
          title: "    روغن    ",
          items: [
            "روغن مایع",
            "روغن جامد و نیمه جامد",
            "روغن زیتون",
            "زوغن ذرت",
            "روغن کنجد",
            "روغن حیوانی",
          ],
        },
        {
          title: "  چای و دمنوش      ",
          items: ["چای سیاه", "چای سبز", "دمنوش", "چای ماسالا"],
        },
        {
          title: "   قهوه     ",
          items: ["دانه قهوه", "قهوه فوری", "قهوه اسپرسو"],
        },
        {
          title: "   غذاهای آماده و نیمه آماده     ",
          items: [
            "تن ماهی",
            "نودل",
            "غذاهای آماده یخچالی",
            "غذاهای آماده کنسروی",
          ],
        },
        {
          title: "    حبوبات و سویا    ",
          items: ["عدس", "ماش", "کینوا", "لپه", "نخود", "لوبیا", "سویا"],
        },
        {
          title: "   ادویه و افزودنی     ",
          items: ["زعفران", "زرشک", "فلفل", "نمک", "هل", "زنجبیل", "زردچوبه"],
        },
        {
          title: "     لبنیات   ",
          items: ["شیر", "پنیر", "کره", "ماست", "دوغ", "خامه", "کشک"],
        },
        {
          title: "     صبحانه   ",
          items: [
            "کره بادام زمینی",
            "شکلات صبحانه",
            "غلات صبحانه",
            "عسل",
            "پنیر صبحانه",
          ],
        },
        {
          title: "  نوشیدنی      ",
          items: [
            "آب معدنی",
            "نوشابه",
            "ماءالشعیر",
            "انرژی زا",
            "شربت وآبمیوه",
            "عرقیات و گلاب",
          ],
        },
        {
          title: "      ترشی و شور  ",
          items: ["زیتون", "ترشی", "شور", "خیارشور"],
        },
        {
          title: "    تنقلات    ",
          items: [
            "چیپس",
            "پفک",
            "تخمه",
            "لواشک",
            "کیک و کلوچه",
            "شکلات",
            "پاستیل",
            "آدامس",
            "بیسکویت",
          ],
        },
        {
          title: "     آجیل   ",
          items: [
            "فندق",
            "پسته",
            "بادام درختی",
            "بادام هندی",
            "بادام زمینی",
            "انجیر",
          ],
        },
        {
          title: "   شیرینی     ",
          items: ["گز ، سوهان و پولکی", "پشمک، مسقطی و باسلوق"],
        },
        {
          title: "  مواد پروتئینی و تخم مرغ      ",
          items: [
            "گوشت گوسفند",
            "گوشت مرغ",
            "گوشت گوساله",
            "تخم مرغ",
            "ماهی",
            "میگو",
            "خاویار",
            "سوسیس",
          ],
        },
        {
          title: "   میوه و سبزیجات     ",
          items: ["میوه", "سبزیجات", "خرما"],
        },
        {
          title: "   بهداشت و نظافت خانگی     ",
          items: [
            "اسکاج و سیم ظرفشویی",
            "دستکش نظافت",
            "مواد شوینده",
            "شوینده لباس",
            "شویندظروف",
            "شوینده سطوح",
            "شوینده فرش و مبل",
            "لوازم یکبار مصرف آشپزخانه",
            "دستمال کاغذی",
          ],
        },
        {
          title: "   بهداشت و خوراک کودک     ",
          items: [
            "غذای کودک",
            "پوشک کودک",
            "دهانشویه و خمیر دندان کودک",
            "مسواک کودک",
            "دستمال مرطوب کودک",
            "کرم، پالم و لوسیون کودک",
            "شامپو کودک",
            "شوینده لباس کودک",
          ],
        },
        {
          title: "   بهداشت شخصی     ",
          items: ["بهداشت دهان و دندان", "کاندوم", "پد بهداشتی"],
        },
      ],
    },
    {
      title: "اسباب بازی، کودک و نوزاد",
      logo: <LuBaby size={20} />,
      id: 13,
      detailMenu: [
        {
          title: "   بهداشت و حمام کودک و نوزاد     ",
          items: [
            "پوشک",
            "دستمال مرطوب",
            "حوله",
            "وان حمام نوزاد",
            "مینی واش",
            "شامپو کودک و نوزاد",
          ],
        },
        {
          title: "    پوشاک و کفش کودک و نوزاد     ",
          items: [
            "لباس کودک و لباس نوزادی",
            "کفش",
            "جوراب و پاپوش کودک و نوزاد",
            "کلاه و پیش بند نوزاد",
          ],
        },
        {
          title: "    تبلت     ",
          items: [],
        },
        {
          title: "   پلی استیشن،ایکس باکس و بازی     ",
          items: [],
        },
        {
          title: "    اسباب بازی   ",
          items: [
            "فکری و آموزشی",
            "پازل، لگو و ساختنی",
            "عروسک و فیگور",
            "اسپینر، ابزار شوخی و سرگرمی",
            "تفنگ، تیر و لوازم جنگی",
          ],
        },
        {
          title: "   بازی و سرگرمیی کودک     ",
          items: [
            "ماشین بازی، موتور و سه چرخه",
            "دوچرخه",
            "تشک بازی و پارک بازی",
            "تاب و سرسره",
          ],
        },
        {
          title: "   سلامت، ایمنی و مراقبت     ",
          items: [
            "ترازو",
            "تصفیه هوا",
            "دوربین و پیجر اتاق کودک",
            "تب سنج و دماسنج",
            "محافظ و ابزار ایمنی",
          ],
        },
        {
          title: "   خواب کودک    ",
          items: [
            "مبلمان اتاق کودک",
            "چراغ خواب کودک",
            "تشک کودک",
            "سرویس خواب",
            "پتو",
            "بالش شیردهی",
          ],
        },
        {
          title: "   ملزومات گردش و سفر     ",
          items: [
            " کالسکه و کریر ",
            "صندلی خودرو کودک و نوزاد  ",
            " ساک لوازم نوزاد ",
            " لوازم جانبی گردش و سفر ",
            " آغوشی ",
          ],
        },
        {
          title: " لوازم شخصی       ",
          items: [" پستانک و ملزومات ", "شیردوش  ", " شورت آموزشی "],
        },
        {
          title: "  غذا خوری      ",
          items: ["  صندلی غذاخوری", " شیشه شیر، سرلاک و داروسازی "],
        },
      ],
    },
    {
      title: "   ابزار آلات و تجهیزات",
      logo: <SlWrench size={20} />,
      id: 14,
      detailMenu: [
        {
          title: "  ابزار برقی      ",
          items: [
            "  دریل،پیج گوشتی آچار بکس",
            "فرز و سنگ رومیزی  ",
            "موتور برق  ",
            " مکنده-دمنده ",
            "  جاروبرقی صنعتی",
            " کارواش ",
            " دستگاه جوش ",
            " هویه ",
            "ابزار برش و تراشکاری  ",
            " کمپرسور هوا ",
            "  مولتی متر",
            " لوازم جانبی و یدکی ابزار برقی ",
            "اره زنجیری  ",
          ],
        },
        {
          title: "      ابزار غیر برقی  ",
          items: [
            " ابزار دستی ",
            "  مجموعه ابزار",
            "  نردبان",
            "پیچ گوشتی و فازمتر  ",
            "نظم دهنده ابزار  ",
            " متر، ترازو ،اندازه گیری دقیق ",
            "  چسب صنعتی",
            " لوازم روانکاری ",
            "  انواع آچار و انبر",
            " پیچ و مهره ، رول پلاک ، میخ و پرچ ",
            "  مته و سری",
            " اره ",
            "  لوازم بسته بندی",
          ],
        },
        {
          title: "   لوازم الکتریکی و یراق آلات     ",
          items: [
            "  شیرآلات",
            "رنگ  ",
            "   لوازم الکتریکی  ",
            " مصالح ساختمانی ",
            " زنگ و در بازی ",
          ],
        },
        {
          title: "  لوازم باغبانی و کشاورزی      ",
          items: [
            "  ابزار باغبانی",
            " ادوات کشاورزی ",
            " بذر و تخم گیاهان ",
            " خاک،کود و آفت کش ",
            " کاشت و پروش گیاه ",
          ],
        },
        {
          title: "    تجهیزات ایمنی و کار    ",
          items: [
            " ماسک تنفسی ",
            " لوازم آتش نشانی ",
            " لوازم ایمنی و کار ",
            " جعبه کمک های اولیه ",
            " برچسب و علائم ایمنی ",
          ],
        },
        {
          title: "     حفاظتی و امنیتی   ",
          items: ["  گاوصندوق", " قفل "],
        },
        {
          title: "  دستگاه های حمل و بالابر صنعتی       ",
          items: [" قطعات یدکی ماشین آلات صنعتی ", "تجهیزات کارگاهی  "],
        },
      ],
    },
    {
      title: "خودرو و موتورسیکلت",
      logo: <IoCarSportOutline size={20} />,
      id: 15,
      detailMenu: [
        {
          title: " لوازم مصرفی خودرو       ",
          items: [
            " روغن موتور ",
            " فیلترها ",
            " قطعات سرویسی ",
            " روغن گیربکس ",
            " روغن هیدرولیک ",
            " ضدیخ و آب رادیاتور ",
            "باتری  ",
            " لاستیک ",
            " مکمل سوخت و روغن  ",
            "  واکس و پولیش",
            " لوازم نظافت خودرو ",
          ],
        },
        {
          title: "   لوازم یدکی خودرو     ",
          items: [
            " لوازم بدنه  ",
            " چراغ ",
            " آینه جانبی ",
            " لوازم جلوبندی و تعلیق ",
            " لوازم الکترونیکی ",
            " لوازم مکانیکی ",
          ],
        },
        {
          title: "    لوازم صوتی و تصویری    ",
          items: [
            " دستگاه پخش ",
            "  بلندگو",
            " آمپیلی فایر ",
            "اف ام پلیر  ",
            " مسیریاب خودرو ",
            " لوازم جانبی صوتی و تصویری ",
          ],
        },
        {
          title: "   لوازم جانبی خودرو     ",
          items: [
            "لامپ  ",
            " سایر لوازم جانبی ",
            "تجهیزات آفرود  ",
            " تیونینگ و تقویت موتور ",
            " انواع چک ",
            "  جاسوئیچی",
            " خوشبو کننده و تصفیه کننده هوای کابین ",
            " باربند ",
            " سر اگزوز ",
            " سر دنده ",
            "  روکش صندلی",
            "  لوازم ضدسرقت",
            " لوازم تزئینی خودرو ",
            " چادر خودرو ",
            " تجهیزات راحتی خودرو ",
            " تجهیزات نظم دهنده ",
            " عایق کاپوت، صندوق و دربها ",
            " کفپوش صندوق خودرو ",
            " کفپوش خودرو ",
          ],
        },
        {
          title: "   لوازم موتور سیکلت     ",
          items: [
            " لوازم مصرفی ",
            " لوازم یدکی ",
            " لوازم جانبی ",
            " لوازم ضد سرقت ",
          ],
        },
        {
          title: "   موتورسیکلت     ",
          items: [],
        },
        {
          title: "خودرو",
          items: [],
        },
      ],
    },
  ];
  return sidebarMenuData;
}

export default ProductModalData;
